#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t
#+OPTIONS: broken-links:nil c:nil creator:nil d:(not "LOGBOOK") date:t e:t
#+OPTIONS: email:nil f:t inline:t num:t p:nil pri:nil prop:nil stat:t tags:t
#+OPTIONS: tasks:t tex:t timestamp:t title:t toc:t todo:t |:t
#+TITLE: CS345 : Operating Systems
#+DATE: <2018-01-20 Sat>
#+AUTHOR: Colton Kopsa
#+EMAIL: Aghbac@Aghbac.local
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 25.3.1 (Org mode 9.1.6)

* DONE Reading Chapter 3 cont.
  CLOSED: [2018-01-24 Wed 10:38] DEADLINE: <2018-01-24 Wed>
  :LOGBOOK:
  CLOCK: [2018-01-24 Wed 10:05]--[2018-01-24 Wed 10:37] =>  0:32
  :END:
  IPC, Client-Server (3.4, 3.5.3, 1st paragraph in 3.6.1, three paragraphs in
  3.6.2, 3.6.3 – 3.7)
** DONE CPU scheduling (6.3.4 – 6.3.6, 6.5; Lab 3 handout)
   CLOSED: [2018-01-29 Mon 16:19]
   :LOGBOOK:
   CLOCK: [2018-01-29 Mon 09:00]--[2018-01-29 Mon 10:00] =>  1:00
   :END:
* DONE Lab 4
  CLOSED: [2018-02-20 Tue 19:24] SCHEDULED: <2018-02-20 Tue> DEADLINE: <2018-02-21 Wed>
  #+BEGIN_SRC cpp :results output :tangle /ssh:kopsac@157.201.194.204#215:/home/kop14002/courses/cs345/lab4.cpp
    /***********************************************************************
     ,* Program:
     ,*    Lab Threads
     ,*    Brother Jones, CS 345
     ,* Author:
     ,*    Colton Kopsa
     ,* Summary:
     ,*    Perform M x N matrix multiplication on two matrices using threads.
     ,************************************************************************/
    #include <iostream>
    #include <pthread.h>
    #include <iomanip>
    using namespace std;

    #define M 5  // number of rows in matrix A
    #define K 6  // number of rows in matrix B -- number of columns in matrix A
    #define N 8  // number of columns in matrix B
    #define NUM_THREADS M*N

    // [rows][columns]
    int A [M][K] =
      {
        {1,4,3,7,9,1},
        {2,5,4,8,6,3},
        {3,6,5,8,2,3},
        {3,8,8,1,4,1},
        {1,5,4,5,7,9}
      }
      ;
    int B [K][N] =
      {
        {1,5,6,5,7,9,8,2},
        {1,2,3,5,5,6,7,8},
        {3,5,9,7,3,1,4,1},
        {8,3,1,2,6,5,2,4},
        {3,8,8,1,4, 1,3,3},
        {8,7,6,5,4,3,2,1}
      };
    int C [M][N];  // this is where the answer will be placed

    /* structure for passing data to threads */
    struct ThreadData
    {
      int i; /* row */
      int j; /* column */
    };

    void *print_message_function( void *ptr );

    int main()
    {
      pthread_t threads[NUM_THREADS];

      /* We have to create M * N worker threads */
      int threadCount = 0;
      for (int i = 0; i < M; i++)
        for (int j = 0; j < N; j++ )
          {
            ThreadData* tData = new ThreadData;
            tData->i = i;
            tData->j = j;
            /* Now create the thread passing it tData as
               a parameter */
            pthread_create( &threads[threadCount++], NULL, print_message_function, (void*) tData);
          }

      for (int i = 0; i < NUM_THREADS; i++)
        pthread_join(threads[i], NULL);

      cout << "The product of matrices A and B is:\n";
      for(int i = 0; i < M; i++)
        {
          for(int j = 0; j < N; j++)
            {
              cout << setw(8) << C[i][j];
            }
          cout << endl;
        }

      return 0;
    }

    void *print_message_function( void *ptr )
    {
      ThreadData *data;
      data = (ThreadData *) ptr;
      int i, sum = 0;
      for(i = 0; i < K; i++)
        {
          sum += A[data->i][i] * B[i][data->j];
        }
      C[data->i][data->j] = sum;
      pthread_exit(0);
    }
  #+END_SRC

  #+RESULTS:
  : The product of matrices A and B is:
  :      105     128     130      74     118      83      91      93
  :      125     133     137     100     135     107     107     101
  :      118     113     123     113     134     119     114     100
  :       63     113     153     122     111      95     128      95
  :      151     169     172     120     138     102     108      96
  
  #+BEGIN_SRC python :results output
    print "Howdy"
  #+END_SRC

  #+RESULTS:
  : Howdy
